Revit 2025 API
PartType Enumeration
 An enumerated type listing all MEP family part types. A part type typically provides one unique set of type parameters that defines this part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum PartType
Public Enumeration PartType
public enum class PartType
type PartType
Members
Member name | Value | Description
Normal | 0 |  Normal part type
DuctMounted | 1 |  Duct mounted part type
JunctionBox | 2 |  JunctionBox part type
AttachesTo | 3 |  Attaches to part type
BreaksInto | 4 |  Breaks into part type
Elbow | 5 |  Elbow part type
Tee | 6 |  Tee part type
Transition | 7 |  Transition part type
Cross | 8 |  Cross part type
Cap | 9 |  Cap part type
Undefined | -1 |  Undefined part type
TapPerpendicular | 10 |  Tap perpendicular part type
TapAdjustable | 11 |  Tap adjustable part type
Offset | 12 |  Offset part type
Union | 13 |  Union part type
PanelBoard | 14 |  Panel board part type
Transformer | 15 |  Transformer part type
SwitchBoard | 16 |  Switch board part type
OtherPanel | 17 |  Other panel part type
EquipmentSwitch | 18 |  Equipment switch part type
Switch | 19 |  Switch part type
ValveBreaksInto | 20 |  Valve breaks into part type
SpudPerpendicular | 21 |  Spud perpendicular part type
SpudAdjustable | 22 |  Spud adjustable part type
Damper | 23 |  Damper part type
Wye | 24 |  Wye part type
LateralTee | 25 |  Lateral tee part type
LateralCross | 26 |  Lateral cross part type
Pants | 27 |  Pants part type
MultiPort | 28 |  Multi port part type
ValveNormal | 29 |  Valve normal part type
JunctionBoxTee | 30 |  JunctionBox tee part type
JunctionBoxCross | 31 |  JunctionBox cross part type
PipeFlange | 32 |  Pipe flange part type
JunctionBoxElbow | 34 |  JunctionBox elbow part type
ChannelCableTrayElbow | 35 |  Channel CableTray Elbow part type
ChannelCableTrayVerticalElbow | 36 |  Channel CableTray Vertical Elbow part type
ChannelCableTrayCross | 37 |  Channel CableTray Cross part type
ChannelCableTrayTee | 38 |  Channel CableTray Tee part type
ChannelCableTrayTransition | 39 |  Channel CableTray Transition part type
ChannelCableTrayUnion | 40 |  Channel CableTray Union part type
ChannelCableTrayOffset | 41 |  Channel CableTray Offset part type
ChannelCableTrayMultiPort | 42 |  Channel CableTray MultiPort part type
LadderCableTrayElbow | 43 |  Ladder CableTray Elbow part type
LadderCableTrayVerticalElbow | 44 |  Ladder CableTray Vertical Elbow part type
LadderCableTrayCross | 45 |  Ladder CableTray Cross part type
LadderCableTrayTee | 46 |  Ladder CableTray Tee part type
LadderCableTrayTransition | 47 |  Ladder CableTray Transition part type
LadderCableTrayUnion | 48 |  Ladder CableTray Union part type
LadderCableTrayOffset | 49 |  Ladder CableTray Offset part type
LadderCableTrayMultiPort | 50 |  Ladder CableTray MultiPort part type
InlineSensor | 51 |  Inline Sensor part type
Sensor | 52 |  Sensor part type
EndCap | 53 |  EndCap part type
HandrailBracketHardware | 54 |  Handrail Bracket Hardware part type
PanelBracketHardware | 55 |  Panel Bracket Hardware part type
TerminationHardware | 56 |  Termination Hardware part type
Rails | 57 |  Rails part type
Handrails | 58 |  Handrails part type
TopRails | 59 |  Top Rails part type
PipeMechanicalCoupling | 60 |  Pipe Mechanical Coupling part type
See Also
Reference
Autodesk.Revit.DB Namespace